In [1]:
import numpy as np
import seaborn as sns

In [2]:

df = sns.load_dataset('healthexp')

In [3]:
df.head()

   Year        Country  Spending_USD  Life_Expectancy
0  1970        Germany       252.311             70.6
1  1970         France       192.143             72.2
2  1970  Great Britain       123.993             71.9
3  1970          Japan       150.437             72.0
4  1970            USA       326.961             70.9

In [4]:
#covariance

In [5]:
numeric = df.select_dtypes(include=[np.number])

In [6]:
numeric

     Year  Spending_USD  Life_Expectancy
0    1970       252.311             70.6
1    1970       192.143             72.2
2    1970       123.993             71.9
3    1970       150.437             72.0
4    1970       326.961             70.9
..    ...           ...              ...
269  2020      6938.983             81.1
270  2020      5468.418             82.3
271  2020      5018.700             80.4
272  2020      4665.641             84.7
273  2020     11859.179             77.0

[274 rows x 3 columns]

In [7]:
np.cov(numeric,rowvar=False,)

array([[2.01098848e+02, 2.57188274e+04, 4.19154541e+01],
       [2.57188274e+04, 4.81776066e+06, 4.16680091e+03],
       [4.19154541e+01, 4.16680091e+03, 1.07339023e+01]])

In [8]:
np.corrcoef(numeric,rowvar=False)

array([[1.        , 0.82627338, 0.90217454],
       [0.82627338, 1.        , 0.57943046],
       [0.90217454, 0.57943046, 1.        ]])

In [9]:
import pandas as pd

In [10]:
numeric.corr()

                     Year  Spending_USD  Life_Expectancy
Year             1.000000      0.826273         0.902175
Spending_USD     0.826273      1.000000         0.579430
Life_Expectancy  0.902175      0.579430         1.000000

In [11]:
numeric.cov()

                         Year  Spending_USD  Life_Expectancy
Year               201.098848  2.571883e+04        41.915454
Spending_USD     25718.827373  4.817761e+06      4166.800912
Life_Expectancy     41.915454  4.166801e+03        10.733902

In [12]:
numeric.corr(method='pearson')

                     Year  Spending_USD  Life_Expectancy
Year             1.000000      0.826273         0.902175
Spending_USD     0.826273      1.000000         0.579430
Life_Expectancy  0.902175      0.579430         1.000000

In [13]:
numeric.corr(method='spearman')

                     Year  Spending_USD  Life_Expectancy
Year             1.000000      0.931598         0.896117
Spending_USD     0.931598      1.000000         0.747407
Life_Expectancy  0.896117      0.747407         1.000000

In [14]:
numeric.corr(method='kendall')

                     Year  Spending_USD  Life_Expectancy
Year             1.000000      0.787151         0.737203
Spending_USD     0.787151      1.000000         0.571620
Life_Expectancy  0.737203      0.571620         1.000000

In [15]:
df1 = sns.load_dataset('flights')

In [16]:
df1.head()

   year month  passengers
0  1949   Jan         112
1  1949   Feb         118
2  1949   Mar         132
3  1949   Apr         129
4  1949   May         121

In [17]:
df1 = df1.select_dtypes(include=np.number)

In [18]:
df1

     year  passengers
0    1949         112
1    1949         118
2    1949         132
3    1949         129
4    1949         121
..    ...         ...
139  1960         606
140  1960         508
141  1960         461
142  1960         390
143  1960         432

[144 rows x 2 columns]

In [19]:
df1.cov()

                  year    passengers
year         12.000000    383.087413
passengers  383.087413  14391.917201

In [20]:
df1.corr()*100

                  year  passengers
year        100.000000   92.182384
passengers   92.182384  100.000000

In [21]:
df1.corr(method='spearman')

                year  passengers
year        1.000000    0.950549
passengers  0.950549    1.000000

In [22]:
df1.corr(method='kendall')

                year  passengers
year        1.000000    0.830238
passengers  0.830238    1.000000